<?php
if (!defined('XOOPS_ROOT_PATH')) {
    exit();
}

define("_LCX_ADM_CONFIG", "ÀßÄê ");
define("_LCX_ADM_GENCONF", "°ìÈÌÀßÄê");
define("_LCX_ADM_LOGCONF", "¾ÜºÙÀßÄê");
define("_LCX_ADM_REPCONF", "¥ì¥�?¡¼¥ÈÀßÄê");
define("_LCX_ADM_REBUILD", "¥í¥°¤ÎºÆ¹½ÃÛ");
define("_LCX_ADM_IMGSLCT", "²è�?ü�?ªÂò");
define("_LCX_ADM_DBCHECK", "£Ä£Â¥�?¥§¥Ã¥¯");
define("_LCX_ADM_BLOCKSADMIN", "¥Ö¥í¥Ã¥¯´É�?ý");
define("_LCX_ADM_GENCONF_DESC", "É½¼¨¤¹¤ë¥«¥¦¥ó¥¿¤ÎÆâ�?ÆÅù¤òÀßÄê¤·¤Þ¤¹");
define("_LCX_ADM_LOGCONF_DESC", "¥«¥¦¥ó¥È½é´üÃ�?¤ä¥ì¥�?¡¼¥ÈÂ�?¾�?³°¥Û¥¹¥ÈÅù¤òÀßÄê¤·¤Þ¤¹");
define("_LCX_ADM_REPCONF_DESC", "¥ì¥�?¡¼¥È¤ÎÉ½¼¨Æâ�?Æ¤òÀßÄê¤·¤Þ¤¹");
define("_LCX_ADM_REBUILD_DESC", "¥í¥°Æâ¤Î¸¡º÷¸ì¤ä£�?£Ó¥¿¥¤¥×Åù¤òºÆÈ½Äê¤·¤Þ¤¹¡¡¡ÊÂ¿¾¯»þ´Ö¤¬¤«¤«¤ê¤Þ¤¹¡Ë<br />Protector¥â¥¸¥å¡¼¥ë»È�?Ñ¤Î¾ì¹ç¤�?¡¢F5¥¢¥¿¥Ã¥¯¤È¸íÇ§¤µ¤ì¤ë´í¸±À­¤¬¤¢¤ê¤Þ¤¹");
define("_LCX_ADM_IMGSLCT_DESC", "¥«¥¦¥ó¥¿É½¼¨¤Ë»È¤¦²è�?ü¤ò�?ªÂò¤·¤Þ¤¹¡¡¡Ê¥µ¡¼¥�?¤ÎÀßÄê¤Ë¤è¤Ã¤Æ¤�?µ¡Ç½¤·¤Þ¤»¤ó¡Ë");
define("_LCX_ADM_DBCHECK_DESC", "¥Ç¡¼¥¿¥Ù¡¼¥¹¤Î¥�?¥§¥Ã¥¯¤ÈºÇÅ¬²½¤ò¹Ô¤¤¤Þ¤¹");
define("_LCX_ADM_BLOCKSADMIN_DESC", "¥Ö¥í¥Ã¥¯´É�?ý¤ò¹Ô¤¤¤Þ¤¹ (Thanks to GIJOE.)");

define("_LCX_ADM_CUPBLK_SET", "¥«¥¦¥ó¥È¥Ö¥í¥Ã¥¯¤ò¼«Æ°¤Ç¥»¥Ã¥È¥¢¥Ã¥×");
define("_LCX_ADM_CUPBLK_TITL", "¥«¥¦¥ó¥È¥Ö¥í¥Ã¥¯´É�?ý");
define("_LCX_ADM_CUPBLK_DESC", "¥«¥¦¥ó¥È¥Ö¥í¥Ã¥¯¤Î´É�?ý²èÌÌ¤ò³ÎÇ§¤·¤Þ¤¹");

define("_LCX_ADM_RESETCOUNT_TITLE", "¥«¥¦¥ó¥È½é´üÃ�?");
define("_LCX_ADM_LOGCOUNT_TITLE", "¢« ¥í¥°¥Ç¡¼¥¿Ãæ¤ÎºÇÂç¥«¥¦¥ó¥È(»²¹�?)");
define("_LCX_ADM_RESETCOUNT_DESC", "¸½ºß¤Î¥«¥¦¥ó¥È¤òÇ¤°Õ¤ÎÃ�?¤ËÊÑ¹¹¤·¤Þ¤¹");
define("_LCX_ADM_TIMEOFFSET_NAME", "Æü»þ¥ª¥Õ¥»¥Ã¥È (-12 ¡�? +12)");
define("_LCX_ADM_TIMEOFFSET_DESC", "³¤³°¤Ë¥µ¡¼¥�?¤¬¤¢¤ë¾ì¹çÅù¡¢¥µ¡¼¥�?Æü»þ¤È¥ì¥�?¡¼¥È�?ÑÆü»þ¤Îº¹Ê¬¤ò»þ´ÖÃ±°Ì¤ÇÆþÎ�?¤·¤Æ¤¯¤À¤µ¤¤<br />²¼¤Î¡ÖÊäÀµ¸åÆü»þ¡×¤¬¤¢¤Ê¤¿¤Î»þ·×¤È¹ç¤Ã¤Æ¤¤¤ì¤�?²¿¤â¤·¤Ê¤¤¤Ç¤¯¤À¤µ¤¤");
define("_LCX_ADM_TIMEOFFSET_SVTM", "¥µ¡¼¥�?Æü»þ¡§");
define("_LCX_ADM_TIMEOFFSET_ADTM", "ÊäÀµ¸åÆü»þ¡§");
define("_LCX_ADM_ADDIP_TITLE", "¥ì¥�?¡¼¥ÈÂ�?¾�?³°¥Û¥¹¥ÈÄÉ²Ã");
define("_LCX_ADM_ADDIP_DESC", "¥ì¥�?¡¼¥È½�?Î�?»þ¤ËÌµ»ë¤¹¤ë¥Û¥¹¥È¤òÄÉ²Ã¤·¤Þ¤¹<br />%¤¬¥ï¥¤¥ë¥É¥«¡¼¥É¤È¤·¤Æ»È¤¨¤Þ¤¹<br />(Îã¡§%.googlebot.com)");
define("_LCX_ADM_ADDREF_TITLE", "¥ì¥�?¡¼¥ÈÂ�?¾�?³°¥ê¥Õ¥¡¥éÄÉ²Ã");
define("_LCX_ADM_ADDREF_DESC", "¥ì¥�?¡¼¥È½�?Î�?»þ¤ËÌµ»ë¤¹¤ë¥ê¥Õ¥¡¥é¡Ê¥ê¥ó¥¯¸µ¡ËÊ¸»úÎó¤òÄÉ²Ã¤·¤Þ¤¹<br />»ØÄê¤·¤¿Ê¸»úÎó¤¬´Þ¤Þ¤ì¤ë¥ê¥Õ¥¡¥é¡Ê¥ê¥ó¥¯¸µ¡Ë¤¬Â�?¾�?³°¤Ë¤Ê¤ê¤Þ¤¹");
define("_LCX_ADM_YOURHOST_TITLE", "¤¢¤Ê¤¿¤Î¥¢¥¯¥»¥¹¸µ");
define("_LCX_ADM_YOURHOST_ADD", "¥ì¥�?¡¼¥ÈÂ�?¾�?³°¤Ë¤¹¤ë");
define("_LCX_ADM_DELETEIP_TITLE", "Â�?¾�?³°¥Û¥¹¥Èºï½ü");
define("_LCX_ADM_DELETEIP_DESC", "¥ì¥�?¡¼¥È½�?Î�?»þ¤ËÌµ»ë¤¹¤ë¥Û¥¹¥È¤òºï½ü¤·¤Þ¤¹");
define("_LCX_ADM_DELETEREF_TITLE", "Â�?¾�?³°¥ê¥Õ¥¡¥éºï½ü");
define("_LCX_ADM_DELETEREF_DESC", "¥ì¥�?¡¼¥È½�?Î�?»þ¤ËÌµ»ë¤¹¤ë¥ê¥Õ¥¡¥é¡Ê¥ê¥ó¥¯¸µ¡ËÊ¸»úÎó¤òºï½ü¤·¤Þ¤¹");

define("_LCX_ADM_REPORTING_TITLE", "¥ì¥�?¡¼¥ÈÂ�?¾�?");
define("_LCX_ADM_REPORTING_DESC", "¥ì¥�?¡¼¥ÈÂ�?¾�?¤È¤¹¤ë¥¢¥¯¥»¥¹¼Ô¤òÀßÄê¤·¤Þ¤¹");
define("_LCX_ADM_REPORTING_ALL", "�?´Éô");
define("_LCX_ADM_REPORTING_WORBT", "¥í¥Ü¥Ã¥È¤ò½ü¤¯");
define("_LCX_ADM_REPORTING_ROBOT", "¥í¥Ü¥Ã¥È¤Î¤ß");

define("_LCX_ADM_BY_R2", "»²¾È¸µ£Õ£Ò£ÌÊÌ¡Ê¥µ¥Þ¥ê¡¼¡ËÉ½¼¨");
define("_LCX_ADM_BY_OS", "¥¯¥é¥¤¥¢¥ó¥È£�?£ÓÊÌÉ½¼¨");
define("_LCX_ADM_BY_BR", "¥Ö¥é¥¦¥¶ÊÌÉ½¼¨");
define("_LCX_ADM_BY_RC", "ºÇ¶á¤ÎÆüÊÌÉ½¼¨");
define("_LCX_ADM_BY_DR", "ÆüÊÌ¡Ê¥¢¥¯¥»¥¹¤ÎÂ¿¤¤½ç¡ËÉ½¼¨");
define("_LCX_ADM_BY_WD", "�?ËÆüÊÌÉ½¼¨");
define("_LCX_ADM_BY_TM", "»þ´ÖÂÓÊÌÉ½¼¨");
define("_LCX_ADM_BY_HN", "¥¢¥¯¥»¥¹¸µ¥É¥á¥¤¥óÊÌÉ½¼¨");
define("_LCX_ADM_BY_RF", "»²¾È¸µ£Õ£Ò£Ì¡ÊºÇ¶á¡ËÉ½¼¨");
define("_LCX_ADM_BY_QW", "¸¡º÷¥ï¡¼¥ÉÊÌÉ½¼¨");
define("_LCX_ADM_BY_UN", "XOOPS¥æ¡¼¥¶Ì¾ÊÌÉ½¼¨");
define("_LCX_ADM_BY_PI", "Åö¥µ¥¤¥ÈÆâË¬ÌäÀèÊÌÉ½¼¨");
define("_LCX_ADM_REFLINK", "£Õ£Ò£Ì¤ò¥ê¥ó¥¯¤Ë¤¹¤ë");

define("_LCX_ADM_FOR_GUEST", "¥²¥¹¥È�?ÑÉ½¼¨¡§");
define("_LCX_ADM_FOR_USERS", "Å�?�?¿¼Ô�?ÑÉ½¼¨¡§");
define("_LCX_ADM_FOR_ADMIN", "´É�?ý¼Ô�?ÑÉ½¼¨¡§");
define("_LCX_ADM_GUEST", "Ë¬Ìä¼Ô�?´°÷¡¡");
define("_LCX_ADM_USERS", "Å�?�?¿¼Ô�?´°÷¡¡");
define("_LCX_ADM_ADMIN", "´É�?ý¼Ô¤Î¤ß¡¡");
define("_LCX_ADM_NOONE", "É½¼¨¤·¤Ê¤¤¡¡");

define("_LCX_ADM_ROWLIMIT", "É½¼¨·ï¿ô");

define("_LCX_ADM_IMGNOW", "¸½ºß¤Î²è�?ü");
define("_LCX_ADM_STYLE", "Ê¸»úÉ½¼¨¥¹¥¿¥¤¥ë (SPAN¥¿¥°)");

define("_LCX_ADM_DAY_NAME", "ËÜÆü¡§");
define("_LCX_ADM_DAY_DESC", "ËÜÆü¤Î¥«¥¦¥ó¥È¿ô¤òÉ½¼¨¤·¤Þ¤¹¤«");
define("_LCX_ADM_YDAY_NAME", "ºòÆü¡§");
define("_LCX_ADM_YDAY_DESC", "ºòÆü¤Î¥«¥¦¥ó¥È¿ô¤òÉ½¼¨¤·¤Þ¤¹¤«");
define("_LCX_ADM_WEEK_NAME", "º£½µ¡§");
define("_LCX_ADM_WEEK_DESC", "º£½µ¤Î¥«¥¦¥ó¥È¿ô¤òÉ½¼¨¤·¤Þ¤¹¤«");
define("_LCX_ADM_MONTH_NAME", "º£·î¡§");
define("_LCX_ADM_MONTH_DESC", "º£·î¤Î¥«¥¦¥ó¥È¿ô¤òÉ½¼¨¤·¤Þ¤¹¤«");
define("_LCX_ADM_AVE_NAME", "Ê¿¶Ñ¡§");
define("_LCX_ADM_AVE_DESC", "Ê¿¶Ñ¥«¥¦¥ó¥È¿ô¤òÉ½¼¨¤·¤Þ¤¹¤«¡ÊÅö¥â¥¸¥å¡¼¥ëÆ°ºî³«»�?°Ê�?è¤ÎÊ¿¶Ñ¤Ç¤¹¡Ë");
define("_LCX_ADM_IPIT_NAME", "¥¢¥¯¥»¥¹´Ö³Ö");
define("_LCX_ADM_IPIT_DESC", "Æ±°ìIP¥¢¥É¥ì¥¹¤«¤é¤Î¥¢¥¯¥»¥¹¤ò¥«¥¦¥ó¥È¤·¤Ê¤¤»þ´Ö¡ÊÉÃ¿ô¡Ë");
define("_LCX_ADM_NOROBCNT_NAME", "¥í¥Ü¥Ã¥È¤ò¥«¥¦¥ó¥È¤·¤Ê¤¤");
define("_LCX_ADM_NOROBCNT_DESC", "¥µ¡¼¥�?¥í¥Ü¥Ã¥È¤«¤é¤Î¥¢¥¯¥»¥¹¤Ç¤�?¥«¥¦¥ó¥È¥¢¥Ã¥×¤ò¹Ô¤ï¤Ê¤¤");
define("_LCX_ADM_NOHSTCNT_NAME", "¥ì¥�?¡¼¥ÈÂ�?¾�?³°¥Û¥¹¥È¤ò¥«¥¦¥ó¥È¤·¤Ê¤¤");
define("_LCX_ADM_NOHSTCNT_DESC", "¥ì¥�?¡¼¥ÈÂ�?¾�?³°¤«¤é¤Î¥¢¥¯¥»¥¹¤Ç¤�?¥«¥¦¥ó¥È¥¢¥Ã¥×¤ò¹Ô¤ï¤Ê¤¤<br />¥Û¥¹¥È¤ÎÀßÄê¤�?¡¢¥ì¥�?¡¼¥ÈÂ�?¾�?³°¥Û¥¹¥ÈÄÉ²Ã¤Ç¹Ô¤¤¤Þ¤¹");
define("_LCX_ADM_MAXWIDTH_NAME", "¥ì¥�?¡¼¥È¥�?¡¼¤ÎºÇÂçÉý");
define("_LCX_ADM_MAXWIDTH_DESC", "¥ì¥�?¡¼¥È²èÌÌ¤Î²£¥�?¡¼¤ÎºÇÂçÉý¤ò¥Ô¥¯¥»¥ëÃ�?¤Ç»ØÄê¤·¤Þ¤¹");

define("_LCX_ADM_LOGLIM_NAME", "¥í¥°ºÇÂçÊ�?Â¸¿ô");
define("_LCX_ADM_LOGLIM_DESC", "¥Ç¡¼¥¿¥Ù¡¼¥¹¤ËÊ�?Â¸¤¹¤ë¥ì¥³¡¼¥É¿ô¾å¸Â");
define("_LCX_ADM_USER_COOKIE_NAME", "¥æ¡¼¥¶¤òCookie¤ÇÈ½Äê");
define("_LCX_ADM_USER_COOKIE_DESC", "¥æ¡¼¥¶È½Äê¤ËCookie¤Î¤ß¤ò»È�?Ñ¤·¤Þ¤¹¤«");
define("_LCX_ADM_GETHOST_NAME", "¥Û¥¹¥È»²¾È");
define("_LCX_ADM_GETHOST_DESC", "¥ì¥�?¡¼¥È¤Ë¥Û¥¹¥È»²¾È´Ø¿ô(GetHostByAddress)¤ò»È¤¤¤Þ¤¹¤«<br />»È¤¦¾ì¹ç¤Ë¤�?¥ì¥¹¥�?¥ó¥¹¤¬ÃÙ¤¯¤Ê¤ë¤³¤È¤¬¤¢¤ê¤Þ¤¹");

define("_LCX_ADM_BROS_NAME", "¥Ö¥é¥¦¥¶¥ê¥¹¥È");
define("_LCX_ADM_BROS_DESC", "¥¢¥¯¥»¥¹¤¬¤¢¤Ã¤¿¥Ö¥é¥¦¥¶(USER_AGENT)¤ò°ì�?÷É½¼¨¤·¤Þ¤¹");
define("_LCX_ADM_QWORDS_NAME", "¸¡º÷¸ì¥ê¥¹¥È");
define("_LCX_ADM_QWORDS_DESC", "�?´¸¡º÷¸ì¤ò¥ê¥¹¥È¥¢¥Ã¥×É½¼¨¤·¤Þ¤¹");

define("_LCX_ADM_USEIMG", "¥«¥¦¥ó¥¿É½¼¨");
define("_LCX_ADM_IMG", "²è�?ü¤ò»È¤¦");
define("_LCX_ADM_CHR", "Ê¸»ú¤ò»È¤¦");
define("_LCX_ADM_CHGIMG_NOTE", "¢¨¥Æ¡¼¥ÞÌ¾¤ÈÆ±¤¸¥Ç¥£¥ì¥¯¥È¥ê¤Î²è�?ü¤¬¡¢¤³¤ÎÀßÄê¤è¤ê�?¥Àè¤·¤ÆÉ½¼¨¤µ¤ì¤Þ¤¹");

define("_LCX_ADM_CHKDB_NAME", "¥Æ¡¼¥Ö¥ëÌ¾");
define("_LCX_ADM_CHKDB_ROWS", "¥Ç¡¼¥¿¿ô");
define("_LCX_ADM_CHKDB_DATA_LENGTH", "¥µ¥¤¥º");
define("_LCX_ADM_CHKDB_AVG_ROW_LENGTH", "Ê¿¶Ñ¥µ¥¤¥º");
define("_LCX_ADM_CHKDB_DATA_FREE", "¶õÎÎ°è");
define("_LCX_ADM_CHKDB_UPDATE_TIME", "¹¹¿·Æü»þ");
define("_LCX_ADM_CHKDB_OPTIMIZE_DESC", "¶õÎÎ°è¤¬Âç¤­¤¤¾ì¹ç¡¢OPTIMIZE¤ò¼Â¹Ô¤·¤Æ¤¯¤À¤µ¤¤¡£<br />¤¿¤À¤·¡¢½è�?ý¤Ë¤�?»þ´Ö¤¬¤«¤«¤ë¤³¤È¤¬¤¢¤ê¡¢¤½¤Î´Ö¥Æ¡¼¥Ö¥ë¤Ø¤Î¥¢¥¯¥»¥¹¤¬¤Ç¤­¤Þ¤»¤ó¡£");
