<?php
if (!defined('XOOPS_ROOT_PATH')) {
    exit();
}

define("_LCX_TOTAL", "¥¢¥¯¥»¥¹¥í¥°¥ì¥�?¡¼¥È¡¡¡Ê¥í¥°¥«¥¦¥ó¥¿¡Ë");
define("_LCX_VALID", "�?­¸ú¥Ç¡¼¥¿¿ô");

define("_LCX_BY_R2", "»²¾È¸µ£Õ£Ò£ÌÊÌ¡Ê¥µ¥Þ¥ê¡¼¡Ë");
define("_LCX_BY_OS", "¥¯¥é¥¤¥¢¥ó¥È£�?£ÓÊÌ");
define("_LCX_BY_BR", "¥Ö¥é¥¦¥¶ÊÌ");
define("_LCX_BY_RC", "ºÇ¶á¤ÎÆüÊÌ");
define("_LCX_BY_DR", "ÆüÊÌ¡Ê¥¢¥¯¥»¥¹¤¬Â¿¤«¤Ã¤¿½ç¡Ë");
define("_LCX_BY_WD", "�?ËÆüÊÌ");
define("_LCX_BY_TM", "»þ´ÖÂÓÊÌ");
define("_LCX_BY_HN", "¥¢¥¯¥»¥¹¸µ¥É¥á¥¤¥óÊÌ");
define("_LCX_BY_RF", "»²¾È¸µ£Õ£Ò£Ì¡ÊºÇ¶á¡Ë");
define("_LCX_BY_QW", "¸¡º÷¥ï¡¼¥ÉÊÌ");
define("_LCX_BY_UN", "¥æ¡¼¥¶ÊÌ");
define("_LCX_BY_PI", "Ë¬ÌäÀè");

define("_LCX_Sun", "Æü�?Ë");
define("_LCX_Mon", "·î�?Ë");
define("_LCX_Tue", "²�?�?Ë");
define("_LCX_Wed", "¿å�?Ë");
define("_LCX_Thu", "ÌÚ�?Ë");
define("_LCX_Fri", "¶â�?Ë");
define("_LCX_Sat", "ÅÚ�?Ë");
